# #coding:utf-8
# #Author:Mr Zhi
# #4. 将列表['alex', 'eric', 'rain'] 中的每一个元素使用 "_" 连接为一个字符串
# l = ['alex', 'eric', 'rain']
# print('_'.join(l))
# """
#
# 20:46:06
# 17-吴 2017/6/13 20:46:06
# 考核形式是怎样的哦。。
# 20:47:06
# 14组导师-刘又源 2017/6/13 20:47:06
# 问答and写点代码
# 14组导师-刘又源 2017/6/13 20:47:12
# 所以你们准备好麦克
# 17-吴 2017/6/13 20:47:16
# 有点慌
# 17-吴 2017/6/13 20:47:19
# 嗯
# 14组导师-刘又源 2017/6/13 20:47:28
# 不用慌，很轻松
# 17-吴 2017/6/13 20:48:09
# 然后还要远程桌面吗
# 20:48:42
# 14组导师-刘又源 2017/6/13 20:48:42
# 不用
# 17-吴 2017/6/13 20:50:18
# 这样子
# 14组导师-刘又源 2017/6/13 20:52:14
# 都记得有这个考核吧
# 20:52:24
# 14组导师-刘又源 2017/6/13 20:52:24
# 一会儿九点正式开始
# 17-吴 2017/6/13 20:52:35
# 我就是看快到9点了一点动静都没。。。
# 14组导师-刘又源 2017/6/13 20:53:48
# 我已经习惯大家忘记了，所以每次都提前提醒大家别忘记。然并卵
# 8组-李明昌-limich 2017/6/13 20:54:07
#
# 20:54:31
# 8组-李明昌-limich 2017/6/13 20:54:31
# 新版的第三周作业  40分钟搞定
# 8组-李明昌-limich 2017/6/13 20:55:11
# 之前那个作业需求都有点读不懂。。。。我们组老师让我等这周再做，先报名考核。
# 21:01:20
# 14组导师-刘又源 2017/6/13 21:01:20
# 大家都在吧，在的扣个1
# 8组-李明昌-limich 2017/6/13 21:01:26
# 1
# 17-吴 2017/6/13 21:01:28
# 1
# 18组-李英-liyinglc 2017/6/13 21:01:32
# 1
#
# 14组导师-刘又源邀请你参与QQ电话。
#
#      漂 2017/6/13 21:01:47
# 1
# 18组-李英-liyinglc 2017/6/13 21:01:54
# 可以
# 21:03:40
# 14组导师-刘又源 2017/6/13 21:03:40
# 1. Python脚本的头部 #!/usr/bin/env python 作用？
#
#      漂 2017/6/13 21:04:09
# 1
# 14组导师-刘又源 2017/6/13 21:04:42
# 2. 简述ascii、unicode、utf-8、gbk的关系？
# 21:07:55
# 14组导师-刘又源 2017/6/13 21:07:55
# 3. 变量名命名规范
# 14组导师-刘又源 2017/6/13 21:09:24
# 4. 将列表['alex', 'eric', 'rain'] 中的每一个元素使用 "_" 连接为一个字符串
#
#      漂 2017/6/13 21:09:43
# 1
# 17-吴 2017/6/13 21:09:42
# 我还没开。。
# 18组-李英-liyinglc 2017/6/13 21:09:43
# 1
# 17-吴 2017/6/13 21:09:45
# 1
#
# 8组-李明昌-limich 2017/6/13 21:09:54
# 1
# 21:11:46
# 14组导师-刘又源 2017/6/13 21:11:46
# 5. 有如下变量，请实现要求的功能
#         tu = ("alex", [11, 22, {"k1": 'v1', "k2": ["age", "name"], "k3": (11,22,33)}, 44])
#         a. 讲述元祖的特性
#            元组也叫只读列表，跟列表差不多，它只有两个方法，一个是count,一个是index
#                    b. 请问tu变量中的第一个元素 “alex” 是否可被修改？
#         c. 请问tu变量中的"k2"对应的值是什么类型？是否可以被修改？如果可以，请在其中添加一个元素 “Seven”
#
#         d. 请问tu变量中的"k3"对应的值是什么类型？是否可以被修改？如果可以，请在其中添加一个元素 “Seven”
#
# """
# # 6. 字典key都可以是什么类型？cd
# #         A.列表    B.字典   C.字符串  D.数字
# s = "你是风儿%%我是沙%s"
# n = s %('僧')
# print(n)
# def func(arg):
# 	arg.append(55)
# li = [11, 22, 33, 44]
# li = func(li)
# print(li)
#9. 使用while循环实现输出 1-100 内的所有奇数
i  = 0
while (i < 100):
    i +=1
    if i % 2 !=0:
        print(i)


#10. 使用while循环实现输出2 - 3 + 4 - 5 + 6 ... + 100 的和
i =1
sum =0
while (i<100):
    i +=1
    if i % 2==0:
        sum+=i
    else:
        sum-=i
print(sum)

# 4 写代码实现99乘法表（格式化输出）
#
# 5 写代码计算1*2+3*4+5*6+7*8...+99*100
